package Mario;

public class Application {

    public static void main(String[] args) {

        /*프로그램 개요 */
        /*  마리오가 피치공주 찾는 프로그램

        * 시스템 요구사항
        * 1. 마리오 피치공주 루이지는 다같이 성안에있다.
        * 2. 마리오는 피치공주를 잡거나 도망가기를 할 수 있다.
        * 3. 피치공주는 마리오를 잡거나 도망가기를 할 수 있다.
        * 4. 피치공주는 숨어있을수 있다.
        * 5. 마리오는 숨어있을수 있다.
        * 6. 마리오는 루이지에게 말을 걸수있다.
        * 7. 피치공주는 루이지에게 말을걸수있다.
        * 7. 루이지는 마리오와 대화를 할수있다.
        * 8. 루이지는 피치공주와 대화를 할수있다.
        * 9. 마리오는 피치공주에게 잡히면 움직일 수 없다
        * 10. 피치공주는 마리오에게 잡히면 움직일 수 없다.
        */

        /* 객체간 상호작용
        * 마리오가 수신할 수 있는 메시지 (마리오가 해야하는 일)
        * 1. 마리오는 피치공주를 잡을수있다.
        * 2. 마리오는 피치공주에게서 도망을 갈수있다.
        * 3. 루이지와 대화를 할수있다.
        * -------------------------------------------------
        * 피치공주가 수신할 수 있는 메시지 (피치공주가 해야하는 일)
        * 1.마리오를 잡을수 있다.
        * 2.피치공주는 마리오에게서 도망갈수있다.
        * 3.루이지와 대화를 할수있다.
        * -------------------------------------------------
        * 루이지가 수신할 수 있는 메시지 (루이지가 해야하는 일)
        * 1. 마리오와 대화를 할수있다.
        * 2. 피치공주와 대화를 할수있다.
        * */





    }
}









































